Repository: Kreatbox/summarizor
Catalog: lib/l10n/app_*.arb
Languages: ar

source: Settings
ar: الإعدادات

source: Language
ar: اللغة

source: Dark Mode
ar: الوضع الداكن

source: Edit Name
ar: تعديل الاسم

source: Share
ar: مشاركة

source: OK
ar: موافق

# editNameTitle
source: Edit Name
ar: تعديل الاسم

# editNameContent
source: Please enter your new name.
ar: الرجاء إدخال اسمك الجديد.

source: Full Name
ar: الاسم الكامل

source: Cancel
ar: إلغاء

source: Save
ar: حفظ

source: Success
ar: نجاح

# nameUpdatedSuccess
source: Your name has been updated successfully.
ar: تم تحديث اسمك بنجاح.

source: Error
ar: خطأ

# nameUpdatedError
source: Failed to update name. Please try again.
ar: فشل تحديث الاسم. الرجاء المحاولة مرة أخرى.

source: Copied!
ar: تم النسخ!

# invitationCopied
source: The invitation message has been copied to your clipboard.
ar: تم نسخ رسالة الدعوة إلى الحافظة الخاصة بك.

# invitationMessage
source: We invite you to join the "Summarizor app" to learn more easily.
ar: ندعوكم للانضمام إلى تطبيق "Summarizor" للتعلم بسهولة أكبر.

source: Select Language
ar: اختر اللغة

source: English
ar: الإنجليزية

source: Arabic
ar: العربية

source: Available Quizzes
ar: الاختبارات المتاحة

# noQuizzesAvailable
source: No quizzes available. Go to "Create Quiz" to make one!
ar: لا توجد اختبارات متاحة. اذهب إلى "إنشاء اختبار" لعمل واحد!

source: Confirm Deletion
ar: تأكيد الحذف

# areYouSureDeleteQuiz
source: Are you sure you want to permanently delete this quiz?
ar: هل أنت متأكد أنك تريد حذف هذا الاختبار بشكل دائم؟

source: Delete
ar: حذف

source: Deleted
ar: تم الحذف

# quizDeletedSuccess
source: The quiz has been deleted successfully.
ar: تم حذف الاختبار بنجاح.

# quizWithQuestions
source: Quiz with {count} questions
ar: اختبار بـ {count} سؤال

source: Result:
ar: النتيجة:

source: correct
ar: صحيحة

source: wrong
ar: خاطئة

# notYetTaken
source: Not yet taken. Tap to start.
ar: لم يتم إجراؤه بعد. انقر للبدء.

source: Retake Quiz
ar: إعادة الاختبار

source: Delete this quiz
ar: حذف هذا الاختبار

source: Take Quiz
ar: ابدأ الاختبار

source: Incomplete Quiz
ar: اختبار غير مكتمل

# pleaseAnswerAllQuestions
source: Please answer all questions before submitting.
ar: الرجاء الإجابة على جميع الأسئلة قبل الإرسال.

# question
source: Question {index}
ar: سؤال {index}

# results
source: Results: {correctCount} / {totalCount}
ar: النتائج: {correctCount} / {totalCount}

# correctAnswers
source: Correct: {count}
ar: صحيحة: {count}

# wrongAnswers
source: Wrong: {count}
ar: خاطئة: {count}

source: Save Result
ar: حفظ النتيجة

source: Submit Quiz
ar: إرسال الاختبار

source: Summarize Text or File
ar: لخص نصاً أو ملفاً

source: Create a Quiz
ar: أنشئ اختباراً

# savedTextAndDocumentSummaries
source: Saved Text & Document Summaries
ar: ملخصات النصوص والمستندات المحفوظة

source: Saved Summary Quizzes
ar: ملخصات الاختبارات المحفوظة

source: Do the Quizzes
ar: قم بحل الاختبارات

source: Logout
ar: تسجيل الخروج

# version
source: Version 1.0.0
ar: الإصدار 1.0.0

source: Hello,
ar: مرحباً،

source: Guest User
ar: مستخدم زائر

# loginSuccess
source: Login successful! Redirecting...
ar: تم تسجيل الدخول بنجاح!

source: Login Failed
ar: فشل تسجيل الدخول

source: An unknown error occurred.
ar: حدث خطأ غير معروف.

# invalidCredentials
source: No user found for that email or password is incorrect.
ar: لا يوجد مستخدم لهذا البريد الإلكتروني أو كلمة المرور غير صحيحة.

# wrongPassword
source: Wrong password provided for that user.
ar: كلمة المرور المقدمة لهذا المستخدم خاطئة.

# invalidEmail
source: The email provided is invalid.
ar: البريد الإلكتروني المقدم غير صالح.

# unexpectedError
source: An unexpected error occurred. Please try again.
ar: حدث خطأ غير متوقع. الرجاء المحاولة مرة أخرى.

source: Log In
ar: تسجيل الدخول

source: Don't have an account?
ar: ليس لديك حساب؟

source: Sign Up
ar: إنشاء حساب

source: Email
ar: البريد الإلكتروني

# pleaseEnterEmail
source: Please enter your Email
ar: الرجاء إدخال بريدك الإلكتروني

# pleaseEnterValidEmail
source: Please enter a valid Email
ar: الرجاء إدخال بريد إلكتروني صالح

source: Password
ar: كلمة المرور

# pleaseEnterPassword
source: Please enter your password
ar: الرجاء إدخال كلمة المرور الخاصة بك

source: Finish
ar: إنهاء

source: Next
ar: التالي

# createQuizTitle
source: Create a Quiz
ar: إنشاء اختبار

# quizGenerationPrompt
source: Paste text below or upload a PDF/TXT/DOCX file to generate a quiz.
ar: الصق نصاً أو قم بتحميل ملف لإنشاء اختبار.

source: Paste text here...
ar: الصق النص هنا...

source: OR
ar: أو

source: Click to Upload File
ar: انقر لتحميل ملف

# uploaded
source: Uploaded: {fileName}
ar: تم التحميل: {fileName}

source: Generate Quiz
ar: إنشاء اختبار

source: Unsupported Platform
ar: منصة غير مدعومة

# fileProcessingWebError
source: File processing is not supported on web.
ar: معالجة الملفات غير مدعومة على الويب.

source: Unsupported File
ar: ملف غير مدعوم

# docNotSupported
source: DOC files are not supported. Please convert it to DOCX format.
ar: ملفات DOC غير مدعومة. يرجى تحويلها إلى تنسيق DOCX.

# unsupportedFileType
source: Please upload a PDF, TXT, or DOCX file.
ar: يرجى تحميل ملف PDF أو TXT أو DOCX.

source: Input Required
ar: الإدخال مطلوب

# pasteOrUploadFirst
source: Please paste text or upload a file first.
ar: الرجاء لصق نص أو تحميل ملف أولاً.

# quizGeneratedSuccess
source: Quiz generated and saved successfully!
ar: تم إنشاء الاختبار وحفظه بنجاح!

# quizGenerationFailed
source: Failed to generate quiz. Your daily limit may have been exceeded.
ar: فشل إنشاء الاختبار. ربما تجاوزت حدك اليومي.

source: Network Error
ar: خطأ في الشبكة

# checkInternet
source: Please check your internet connection and try again.
ar: يرجى التحقق من اتصالك بالإنترنت والمحاولة مرة أخرى.

source: Limit Reached
ar: تم الوصول إلى الحد الأقصى

# geminiQuotaExceeded
source: ⚠️ You have exceeded the daily free quota for the Gemini API.
ar: ⚠️ لقد تجاوزت الحصة اليومية المجانية لواجهة برمجة تطبيقات Gemini.

# quizGenerationError
source: An unexpected error occurred while generating the quiz. {error}
ar: حدث خطأ غير متوقع أثناء إنشاء الاختبار. {error}

source: Generated Quiz:
ar: الاختبار المُنشأ:

source: Clear and Generate New
ar: مسح وإنشاء جديد

source: Unknown question type.
ar: نوع سؤال غير معروف.

source: Saved Quizzes
ar: الاختبارات المحفوظة

# noQuizzesGenerated
source: No quizzes generated yet for this account.
ar: لم يتم إنشاء اختبارات لهذا الحساب بعد.

# quizSummaryTitle
source: Quiz Summary ({count} Questions)
ar: ملخص الاختبار ({count} أسئلة)

source: Copy Quiz Summary
ar: نسخ ملخص الاختبار

# pleaseEnterFullName
source: Please enter your Fullname
ar: الرجاء إدخال اسمك الكامل

# passwordMinNumber
source: Password must contain at least one number
ar: يجب أن تحتوي كلمة المرور على رقم واحد على الأقل

source: Already have an account?
ar: هل لديك حساب بالفعل؟

# summarizeTitle
source: Summarize Text or File
ar: تلخيص نص أو ملف

# summarizePrompt
source: Paste text below or upload a PDF/TXT/DOCX file to get a summary.
ar: الصق نصاً أدناه أو قم بتحميل ملف PDF/TXT/DOCX للحصول على ملخص.

# summarizeHint
source: You can type or paste any text you want to summarize...
ar: يمكنك كتابة أو لصق أي نص تريد تلخيصه...

source: Generate Summary
ar: إنشاء ملخص

# summaryGeneratedSuccess
source: Summary generated and saved successfully!
ar: تم إنشاء الملخص وحفظه بنجاح!

# summaryGenerationError
source: An unexpected error occurred while summarizing.
ar: حدث خطأ غير متوقع أثناء التلخيص.

source: Generated Summary:
ar: الملخص المُنشأ:

source: Copy Summary
ar: نسخ الملخص

# areYouSureDeleteSummary
source: Are you sure you want to permanently delete this summary?
ar: هل أنت متأكد أنك تريد حذف هذا الملخص بشكل دائم؟

source: Saved Summaries
ar: الملخصات المحفوظة

# noSummariesSaved
source: There are no summaries saved for this account yet.
ar: لا توجد ملخصات محفوظة لهذا الحساب بعد.

# confirmDeleteSummaryMessage
source: Are you sure you want to permanently delete this summary?
ar: هل أنت متأكد من رغبتك في حذف هذا الملخص بشكل دائم؟

# summaryDeletedSuccess
source: The summary has been deleted successfully.
ar: تم حذف الملخص بنجاح.

source: Summary #{number}
ar: ملخص #{number}

# summaryCopiedSuccess
source: The summary has been copied to your clipboard.
ar: تم نسخ الملخص إلى الحافظة الخاصة بك.

source: Delete this summary
ar: حذف هذا الملخص

# questionLabel
source: Q{number}
ar: س{number}

# correctAnswerLabel
source: Correct Answer
ar: الإجابة الصحيحة

# quizCopiedSuccess
source: The quiz has been copied to your clipboard.
ar: تم نسخ الاختبار إلى الحافظة.

# confirmDeletionMessage
source: Are you sure you want to permanently delete this quiz?
ar: هل أنت متأكد من رغبتك في حذف هذا الاختبار بشكل دائم؟

# pasteOrUploadInstruction
source: Paste text below or upload a PDF/TXT/DOCX file to get a summary.
ar: الصق النص أدناه أو قم بتحميل ملف PDF/TXT/DOCX للحصول على ملخص.

# pasteTextHint
source: You can type or paste any text you want to summarize...
ar: يمكنك كتابة أو لصق أي نص تريد تلخيصه...

# clickToUpload
source: Click to upload a file
ar: انقر لتحميل ملف

source: Uploaded: {fileName}
ar: تم الرفع: {fileName}

# generatedSummaryTitle
source: Generated Summary:
ar: الملخص المُنشأ:

# pasteTextOrUploadFile
source: Please paste text or upload a file first.
ar: يرجى لصق نص أو تحميل ملف أولاً.

# geminiApiLimit
source: ⚠️ You may have exceeded your free daily limit for Gemini API usage.
ar: ⚠️ ربما تكون قد تجاوزت حدك اليومي المجاني لاستخدام Gemini API.

# checkInternetConnection
source: Please check your internet connection and try again.
ar: يرجى التحقق من اتصالك بالإنترنت والمحاولة مرة أخرى.

# noReadableTextInDocx
source: No readable text found in DOCX file.
ar: لم يتم العثور على نص قابل للقراءة في ملف DOCX.

source: New Quiz
ar: اختبار جديد

# onboarding1Title1
source: Welcome to
ar: أهلاً بك في

# onboarding1Desc
source: Welcome to Summarizer app! Whether you're a student, teacher, our app makes creating educational content simple and fast.
ar: مرحبًا بك في تطبيق Summarizer! سواء كنت طالباً أو معلماً، فإن تطبيقنا يجعل إنشاء المحتوى التعليمي أمراً بسيطاً وسريعاً.

# onboarding2Title1
source: Learn smarter
ar: تعلم بذكاء

# onboarding2Title2
source: Not harder!
ar: لا بجهد أكبر!

# onboarding2Desc
source: With our summarization and question generation app, you can turn your text files or study materials into concise summaries and tailored questions effortlessly.
ar: باستخدام تطبيقنا للتلخيص وتوليد الأسئلة، يمكنك تحويل ملفاتك النصية أو موادك الدراسية إلى ملخصات موجزة وأسئلة مخصصة دون عناء.

# onboarding3Title1
source: Experience
ar: جرّب قوة

# onboarding3Title2
source: AI powered!
ar: الذكاء الاصطناعي!

# onboarding3Desc
source: Start now by uploading your educational materials. We'll help you summarize them in minutes and create professional-level questions for effective review or testing.
ar: ابدأ الآن بتحميل موادك التعليمية. سنساعدك في تلخيصها في دقائق وإنشاء أسئلة بمستوى احترافي لمراجعة أو اختبار فعال.

# correctCount
source: {count} correct
ar: {count} صحيحة

# wrongCount
source: {count} wrong
ar: {count} خاطئة

# geminiQuizPrompt
source: {languageInstruction} Based on the following text, generate a quiz with {numOfQuestions} questions, including a mix of multiple-choice and true/false types. The output MUST be a valid JSON object. Do not include any text, markdown, or explanation before or after the JSON object. Use the following exact JSON structure: {jsonStructure} Text: {content}
ar: {languageInstruction} بناءً على النص التالي، قم بإنشاء اختبار من {numOfQuestions} سؤال، يتضمن مزيجاً من أنواع الاختيار من متعدد والصواب والخطأ. يجب أن يكون الناتج كائن JSON صالح. لا تقم بتضمين أي نص أو markdown أو شرح قبل أو بعد كائن JSON. استخدم بنية JSON الدقيقة التالية: {jsonStructure} النص: {content}
